Repository: HASHIM-HAMEEM/MolanaModudi
Catalog: MolanaModudi/lib/core/l10n/app_*.arb
Languages: ar, ur

# appTitle
source: Maududi
ar: مودودي
ur: مودودی

# readingTabRefreshTooltip
source: Refresh reading list
ar: تحديث قائمة القراءة
ur: پڑھنے کی فہرست تازہ کریں

# readingTabFailedToLoad
source: Failed to load reading history.
ar: فشل تحميل سجل القراءة.
ur: پڑھنے کی سرگزشت لوڈ کرنے میں ناکام رہا۔

# readingTabTryAgainButton
source: Try Again
ar: حاول مرة أخرى
ur: دوبارہ کوشش کریں

# readingTabEmptyStateTitle
source: Your reading journey awaits
ar: رحلة القراءة الخاصة بك في انتظارك
ur: آپ کا پڑھنے کا سفر منتظر ہے

# readingTabEmptyStateSubtitle
source: Books you read will appear here, allowing you to easily continue your reading journey
ar: الكتب التي تقرأها ستظهر هنا، مما يتيح لك مواصلة رحلة القراءة بسهولة.
ur: آپ جو کتابیں پڑھیں گے وہ یہاں ظاہر ہوں گی، جس سے آپ آسانی سے اپنا پڑھنے کا سفر جاری رکھ سکیں گے۔

# readingTabExploreLibraryButton
source: Explore Library
ar: استكشاف المكتبة
ur: لائبریری دریافت کریں

# readingTabContinueReading
source: Continue Reading
ar: متابعة القراءة
ur: پڑھنا جاری رکھیں

# readingTabReadingHistory
source: Reading History
ar: سجل القراءة
ur: پڑھنے کی سرگزشت

# readingTabProgressLabel
source: Progress
ar: تقدم
ur: پیش رفت

# readingTabContinueButton
source: Continue Reading
ar: متابعة القراءة
ur: پڑھنا جاری رکھیں

# homeScreenSearchHint
source: Search books, videos...
ar: ابحث في الكتب والفيديوهات...
ur: کتابیں، ویڈیوز تلاش کریں...

# homeScreenAppBarTitle
source: Maulana Maududi
ar: مولانا المودودي
ur: مولانا مودودی

# homeScreenFailedToLoadContent
source: Failed to load content
ar: فشل تحميل المحتوى
ur: مواد لوڈ کرنے میں ناکام

# homeScreenUnknownError
source: Unknown error
ar: خطأ غير معروف
ur: نامعلوم خرابی

# homeScreenRetryButton
source: Retry
ar: إعادة المحاولة
ur: دوبارہ کوشش کریں

# homeScreenWelcomeTitle
source: Welcome to Maulana Maududi's Works
ar: مرحباً بك في أعمال مولانا المودودي
ur: مولانا مودودی کے کاموں میں خوش آمدید

# homeScreenWelcomeSubtitle
source: Explore the comprehensive collection
ar: استكشف المجموعة الشاملة
ur: جامع مجموعہ دریافت کریں

# homeScreenFeaturedBooksTitle
source: Featured Books
ar: الكتب المميزة
ur: نمایاں کتابیں

# homeScreenViewAllButton
source: View All
ar: عرض الكل
ur: سب دیکھیں

# homeScreenErrorLoadingFeaturedBooks
source: Error loading featured books
ar: خطأ في تحميل الكتب المميزة
ur: نمایاں کتابیں لوڈ کرنے میں خرابی

# homeScreenNoFeaturedBooks
source: No featured books available
ar: لا توجد كتب مميزة متاحة
ur: کوئی نمایاں کتابیں دستیاب نہیں ہیں

# homeScreenUntitledBook
source: Untitled
ar: بدون عنوان
ur: بلا عنوان

# homeScreenCategoriesTitle
source: Categories
ar: الفئات
ur: زمرے

# homeScreenVideoLecturesTitle
source: Video Lectures
ar: محاضرات الفيديو
ur: ویڈیو لیکچرز

# homeScreenErrorLoadingVideos
source: Error loading videos
ar: خطأ في تحميل مقاطع الفيديو
ur: ویڈیوز لوڈ کرنے میں خرابی

# homeScreenNoVideos
source: No videos available at the moment.
ar: لا توجد مقاطع فيديو متاحة في الوقت الحالي.
ur: اس وقت کوئی ویڈیوز دستیاب نہیں ہیں۔

# homeScreenExploreMoreVideosButton
source: Explore More Videos
ar: استكشف المزيد من مقاطع الفيديو
ur: مزید ویڈیوز دریافت کریں

# homeScreenRecentArticlesTitle
source: Recent Articles
ar: المقالات الأخيرة
ur: حالیہ مضامین

# homeScreenNoRecentArticles
source: No recent articles to display.
ar: لا توجد مقالات حديثة لعرضها.
ur: دکھانے کے لیے کوئی حالیہ مضامین نہیں ہیں۔

# bookDetailScreenLoadingAppBarTitle
source: Loading...
ar: جار التحميل...
ur: لوڈ ہو رہا ہے۔..

# bookDetailScreenLoadingBodyText
source: Loading book details...
ar: جار تحميل تفاصيل الكتاب...
ur: کتاب کی تفصیلات لوڈ ہو رہی ہیں۔..

# bookDetailScreenErrorAppBarTitle
source: Error
ar: خطأ
ur: خرابی

# bookDetailScreenErrorTitle
source: Failed to load book details
ar: فشل تحميل تفاصيل الكتاب
ur: کتاب کی تفصیلات لوڈ کرنے میں ناکام

# bookDetailScreenUnknownError
source: Unknown error occurred
ar: حدث خطأ غير معروف
ur: نامعلوم خرابی پیش آگئی

# bookDetailScreenTryAgainButton
source: Try Again
ar: حاول مرة أخرى
ur: دوبارہ کوشش کریں

# bookDetailScreenShareButton
source: Share Book
ar: شارك الكتاب
ur: کتاب شیئر کریں

# bookDetailScreenAppBarDefaultTitle
source: Book Detail
ar: تفاصيل الكتاب
ur: کتاب کی تفصیل

# bookDetailScreenAvailableOfflineTooltip
source: Available offline
ar: متاح بدون اتصال بالإنترنت
ur: آف لائن دستیاب ہے۔

# bookDetailScreenDownloadOfflineTooltip
source: Download for offline
ar: تنزيل للقراءة بدون اتصال بالإنترنت
ur: آف لائن کے لیے ڈاؤن لوڈ کریں

# bookDetailScreenAlreadyOfflineSnackbar
source: This book is already available offline
ar: هذا الكتاب متاح بالفعل بدون اتصال بالإنترنت
ur: یہ کتاب پہلے ہی آف لائن دستیاب ہے۔

# bookDetailScreenDownloadingSnackbar
source: Downloading book for offline reading...
ar: جار تنزيل الكتاب للقراءة بدون اتصال بالإنترنت...
ur: آف لائن پڑھنے کے لیے کتاب ڈاؤن لوڈ ہو رہی ہے۔..

# bookDetailScreenDownloadFailedSnackbar
source: Failed to download book
ar: فشل تنزيل الكتاب
ur: کتاب ڈاؤن لوڈ کرنے میں ناکام

# bookDetailScreenOverviewTab
source: Overview
ar: نظرة عامة
ur: جائزہ

# bookDetailScreenChaptersTab
source: Chapters
ar: الفصول
ur: ابواب

# bookDetailScreenBookmarksTab
source: Bookmarks
ar: الإشارات المرجعية
ur: بک مارکس

# bookDetailScreenAiInsightsTab
source: AI Insights
ar: رؤى الذكاء الاصطناعي
ur: AI بصیرتیں۔

# bookDetailScreenStartReadingButton
source: Start Reading
ar: ابدأ القراءة
ur: پڑھنا شروع کریں

# bookDetailScreenImageNotFound
source: Image not found
ar: الصورة غير موجودة
ur: تصویر نہیں ملی

# bookDetailScreenNoCover
source: No Cover
ar: لا يوجد غلاف
ur: کوئی سرورق نہیں

# bookDetailScreenDescriptionTitle
source: Description
ar: الوصف
ur: تفصیل

# bookDetailScreenNoDescription
source: No description available.
ar: لا يوجد وصف متاح.
ur: کوئی تفصیل دستیاب نہیں ہے۔

# bookDetailScreenBookDetailsTitle
source: Book Details
ar: تفاصيل الكتاب
ur: کتاب کی تفصیلات

# bookDetailScreenAuthorLabel
source: Author
ar: المؤلف
ur: مصنف

# bookDetailScreenPublisherLabel
source: Publisher
ar: الناشر
ur: ناشر

# bookDetailScreenPagesLabel
source: Pages
ar: الصفحات
ur: صفحات

# bookDetailScreenBookDetailsNotAvailable
source: Book details not available.
ar: تفاصيل الكتاب غير متاحة.
ur: کتاب کی تفصیلات دستیاب نہیں ہیں۔

# bookDetailScreenNoChaptersFound
source: No chapters found
ar: لم يتم العثور على فصول
ur: کوئی ابواب نہیں ملے

# bookDetailScreenSingleReadingInfo
source: This book is presented as a single reading
ar: يتم تقديم هذا الكتاب كقراءة واحدة
ur: یہ کتاب ایک ہی پڑھنے کے طور پر پیش کی گئی ہے۔

# bookDetailScreenVolumePrefix
source: Volume
ar: المجلد
ur: جلد

# bookDetailScreenUntitledVolume
source: Untitled Volume
ar: مجلد بدون عنوان
ur: بلا عنوان جلد

# bookDetailScreenNoChaptersInVolume
source: No chapters in this volume
ar: لا توجد فصول في هذا المجلد
ur: اس جلد میں کوئی ابواب نہیں ہیں۔

# bookDetailScreenCannotOpenChapterError
source: Could not open this chapter. Missing required information.
ar: تعذر فتح هذا الفصل. المعلومات المطلوبة مفقودة.
ur: یہ باب نہیں کھول سکا۔ مطلوبہ معلومات غائب ہیں۔

# bookDetailScreenCannotOpenSectionError
source: Could not open this section. Missing required information.
ar: تعذر فتح هذا القسم. المعلومات المطلوبة مفقودة.
ur: یہ سیکشن نہیں کھول سکا۔ مطلوبہ معلومات غائب ہیں۔

# bookDetailScreenUntitledChapter
source: Untitled Chapter
ar: فصل بدون عنوان
ur: بلا عنوان باب

# bookDetailScreenNoSubtopicsInChapter
source: No sub-topics in this chapter.
ar: لا توجد مواضيع فرعية في هذا الفصل.
ur: اس باب میں کوئی ذیلی عنوانات نہیں ہیں۔

# bookDetailScreenUntitledHeading
source: Untitled Heading
ar: عنوان بدون عنوان
ur: بلا عنوان سرخی

# bookDetailScreenCouldNotLoadBookmarks
source: Could not load bookmarks
ar: تعذر تحميل الإشارات المرجعية
ur: بک مارکس لوڈ نہیں ہو سکے

# bookDetailScreenPleaseTryAgainLater
source: Please try again later
ar: يرجى المحاولة مرة أخرى لاحقًا
ur: براہ کرم کچھ دیر بعد دوبارہ کوشش کریں

# bookDetailScreenNoBookmarksYet
source: No bookmarks yet
ar: لا توجد إشارات مرجعية حتى الآن
ur: ابھی تک کوئی بک مارکس نہیں ہیں۔

# bookDetailScreenAddBookmarksHint
source: You can add bookmarks while reading.
ar: يمكنك إضافة إشارات مرجعية أثناء القراءة.
ur: آپ پڑھتے ہوئے بک مارکس شامل کر سکتے ہیں۔

# bookDetailScreenBookmarkChapterPrefix
source: Chapter:
ar: الفصل:
ur: باب:

# bookDetailScreenRepositoryError
source: Repository error
ar: خطأ في المستودع
ur: ریپوزٹری میں خرابی

# bookDetailScreenAiInsightsComingSoon
source: AI Insights Coming Soon
ar: رؤى الذكاء الاصطناعي قريبًا
ur: AI بصیرتیں جلد آرہی ہیں۔

# readingScreenSettingsPanelTitle
source: Reading Settings
ar: إعدادات القراءة
ur: پڑھنے کی ترتیبات

# readingScreenSettingsPanelPlaceholder
source: Settings panel content
ar: محتوى لوحة الإعدادات
ur: ترتیبات پینل کا مواد

# readingScreenTocPanelTitle
source: Table of Contents
ar: جدول المحتويات
ur: فہرست مضامین

# readingScreenAiToolAnalyzeVocabulary
source: Analyze Vocabulary
ar: تحليل المفردات
ur: الفاظ کا تجزیہ کریں

# readingScreenAiToolSummarize
source: Summarize
ar: تلخيص
ur: خلاصہ کریں

# readingScreenAiToolSimilarBooks
source: Similar Books
ar: كتب مشابهة
ur: ملتی جلتی کتابیں

# readingScreenAppBarDefaultTitle
source: Reading
ar: قراءة
ur: پڑھنا

# readingScreenAiFeaturesTooltip
source: AI Features
ar: ميزات الذكاء الاصطناعي
ur: AI خصوصیات

# readingScreenBookmarkTooltip
source: Bookmark
ar: إشارة مرجعية
ur: بک مارک

# readingScreenTextSettingsTooltip
source: Text Settings
ar: إعدادات النص
ur: متن کی ترتیبات

# readingScreenLoadingBookDetails
source: Loading book details...
ar: جار تحميل تفاصيل الكتاب...
ur: کتاب کی تفصیلات لوڈ ہو رہی ہیں۔..

# readingScreenDownloadingBook
source: Downloading book ({progress}%)...
ar: جار تنزيل الكتاب ({progress}%)...
ur: کتاب ڈاؤن لوڈ ہو رہی ہے ({progress}%)...

# readingScreenPreparingContent
source: Preparing content...
ar: جار تحضير المحتوى...
ur: مواد تیار کیا جا رہا ہے۔..

# readingScreenUnknownError
source: An unknown error occurred.
ar: حدث خطأ غير معروف.
ur: ایک نامعلوم خرابی پیش آگئی۔

# readingScreenFailedToLoadContent
source: Failed to load content
ar: فشل تحميل المحتوى
ur: مواد لوڈ کرنے میں ناکام

# readingScreenRetryButton
source: Retry
ar: إعادة المحاولة
ur: دوبارہ کوشش کریں

# readingScreenContentFallbackTitle
source: Content
ar: المحتوى
ur: مواد

# readingScreenNoContentSegments
source: No content segments to display.
ar: لا توجد مقاطع محتوى لعرضها.
ur: دکھانے کے لیے کوئی مواد کے حصے نہیں ہیں۔

# readingScreenChapterFallbackPrefix
source: Chapter
ar: الفصل
ur: باب

# readingScreenSectionFallbackPrefix
source: Section
ar: القسم
ur: حصہ

# readingScreenNoSectionContent
source: No content for this section.
ar: لا يوجد محتوى لهذا القسم.
ur: اس حصے کے لیے کوئی مواد نہیں ہے۔

# readingScreenChapterExtractionError
source: Could not start chapter extraction
ar: تعذر بدء استخراج الفصل
ur: باب نکالنا شروع نہیں کیا جا سکا

# readingScreenDefinitionNotAvailable
source: Definition not available for this word
ar: التعريف غير متوفر لهذه الكلمة
ur: اس لفظ کے لیے تعریف دستیاب نہیں ہے

# readingScreenPlainTextBookContentTitle
source: Book Content
ar: محتوى الكتاب
ur: کتاب کا مواد

# profileScreenManageNotificationsSubtitle
source: Manage your notification preferences
ar: إدارة تفضيلات الإشعارات الخاصة بك
ur: اپنی اطلاعاتی ترجیحات کا نظم کریں

# profileScreenNotificationsNotImplementedSnackbar
source: Notification settings not implemented yet.
ar: لم يتم تنفيذ إعدادات الإشعارات بعد.
ur: اطلاعاتی ترتیبات ابھی تک نافذ نہیں کی گئیں۔

# profileScreenManageDownloadsSubtitle
source: Manage your download preferences
ar: إدارة تفضيلات التنزيل الخاصة بك
ur: اپنی ڈاؤن لوڈ ترجیحات کا نظم کریں

# profileScreenDownloadsNotImplementedSnackbar
source: Download settings not implemented yet.
ar: لم يتم تنفيذ إعدادات التنزيل بعد.
ur: ڈاؤن لوڈ ترتیبات ابھی تک نافذ نہیں کی گئیں۔

# profileScreenCacheManagementTitle
source: Cache Management
ar: إدارة ذاكرة التخزين المؤقت
ur: کیشے مینجمنٹ

# profileScreenCacheManagementSubtitle
source: View usage and clear cached content
ar: عرض الاستخدام ومسح المحتوى المخزن مؤقتًا
ur: استعمال دیکھیں اور کیشے شدہ مواد صاف کریں

# profileScreenAppInfoTitle
source: App Info
ar: معلومات التطبيق
ur: ایپ کی معلومات

# profileScreenThemeLabel
source: Theme
ar: المظهر
ur: تھیم

# profileScreenThemeLight
source: Light
ar: فاتح
ur: ہلکا

# profileScreenThemeSepia
source: Sepia
ar: بني داكن
ur: سیپیا

# profileScreenThemeDark
source: Dark
ar: داكن
ur: تاریک

# profileScreenFontSizeLabel
source: Font Size
ar: حجم الخط
ur: فونٹ کا سائز

# profileScreenFontSizeSmall
source: Small
ar: صغير
ur: چھوٹا

# profileScreenFontSizeMedium
source: Medium
ar: متوسط
ur: درمیانہ

# profileScreenFontSizeLarge
source: Large
ar: كبير
ur: بڑا

# profileScreenLanguageLabel
source: Language
ar: اللغة
ur: زبان

# profileScreenVersionLabel
source: Version
ar: الإصدار
ur: ورژن

# profileScreenCacheDialogTotalSize
source: Total cache size: {size}
ar: إجمالي حجم ذاكرة التخزين المؤقت: {size}
ur: کل کیشے سائز: {size}

# profileScreenCacheDialogMemoryCacheLabel
source: Memory Cache
ar: ذاكرة التخزين المؤقت للذاكرة
ur: میموری کیشے

# profileScreenCacheDialogPersistentCacheLabel
source: Persistent Cache
ar: ذاكرة التخزين المؤقت الدائمة
ur: مستقل کیشے

# profileScreenCacheDialogDescription
source: Clearing the cache will free up storage space but may cause slower loading times when you next access content.
ar: سيؤدي مسح ذاكرة التخزين المؤقت إلى تحرير مساحة تخزين ولكنه قد يتسبب في بطء أوقات التحميل عند الوصول إلى المحتوى في المرة التالية.
ur: کیشے صاف کرنے سے اسٹوریج کی جگہ خالی ہو جائے گی لیکن اگلی بار مواد تک رسائی حاصل کرنے پر لوڈنگ کے اوقات سست ہو سکتے ہیں۔

# profileScreenCancelButton
source: Cancel
ar: إلغاء
ur: منسوخ کریں

# profileScreenClearMemoryCacheButton
source: Clear Memory Cache
ar: مسح ذاكرة التخزين المؤقت للذاكرة
ur: میموری کیشے صاف کریں

# profileScreenMemoryCacheClearedSnackbar
source: Memory cache cleared
ar: تم مسح ذاكرة التخزين المؤقت للذاكرة
ur: میموری کیشے صاف کر دی گئی

# profileScreenClearPersistentCacheButton
source: Clear Persistent Cache
ar: مسح ذاكرة التخزين المؤقت الدائمة
ur: مستقل کیشے صاف کریں

# profileScreenPersistentCacheClearedSnackbar
source: Persistent cache cleared
ar: تم مسح ذاكرة التخزين المؤقت الدائمة
ur: مستقل کیشے صاف کر دی گئی

# profileScreenClearAllCachesButton
source: Clear All Caches
ar: مسح جميع ذاكرات التخزين المؤقت
ur: تمام کیشے صاف کریں

# profileScreenAllCachesClearedSnackbar
source: All caches cleared
ar: تم مسح جميع ذاكرات التخزين المؤقت
ur: تمام کیشے صاف کر دی گئیں

# profileScreenHelpFAQTitle
source: Help & FAQ
ar: المساعدة والأسئلة الشائعة
ur: مدد اور عمومی سوالنامہ

# profileScreenHelpFAQSubtitle
source: Get answers to frequently asked questions
ar: احصل على إجابات للأسئلة المتداولة
ur: اکثر پوچھے گئے سوالات کے جوابات حاصل کریں

# profileScreenHelpNotImplementedSnackbar
source: Help not implemented yet.
ar: لم يتم تنفيذ المساعدة بعد.
ur: مدد ابھی تک نافذ نہیں کی گئی۔

# profileScreenContactUsTitle
source: Contact Us
ar: اتصل بنا
ur: ہم سے رابطہ کریں

# profileScreenContactUsSubtitle
source: Get in touch with our support team
ar: تواصل مع فريق الدعم لدينا
ur: ہماری سپورٹ ٹیم سے رابطہ کریں

# profileScreenContactNotAvailableSnackbar
source: Contact info not available yet.
ar: معلومات الاتصال غير متوفرة بعد.
ur: رابطے کی معلومات ابھی تک دستیاب نہیں ہیں۔

# videoPlayerScreenCouldNotOpenInYouTubeSnackbar
source: Could not open in YouTube.
ar: تعذر الفتح في يوتيوب.
ur: یوٹیوب میں نہیں کھول سکا۔

# videoPlayerScreenClosePlayerTooltip
source: Close Player
ar: إغلاق المشغل
ur: پلیئر بند کریں

# videoPlayerScreenUnknownChannel
source: Unknown Channel
ar: قناة غير معروفة
ur: نامعلوم چینل

# videoPlayerScreenDescriptionTitle
source: Description
ar: الوصف
ur: تفصیل

# videoPlayerScreenOpenInYouTubeButton
source: Open in YouTube App
ar: فتح في تطبيق يوتيوب
ur: یوٹیوب ایپ میں کھولیں

# readingScreenNoContentAvailable
source: No content available
ar: لا يوجد محتوى متاح
ur: کوئی مواد دستیاب نہیں

# videosScreenTitle
source: Video Library
ar: مكتبة الفيديو

# videosScreenPlaylistsAvailable
source: {count} playlist{count, plural, =1{} other{s}} available
ar: {count} قائمة تشغيل متاحة

# videosScreenLastUpdated
source: Last updated: {time}
ar: آخر تحديث: {time}

# videosScreenJustNow
source: Just now
ar: الآن

# videosScreenMinutesAgo
source: {count} minute{count, plural, =1{} other{s}} ago
ar: منذ {count} دقيقة

# videosScreenHoursAgo
source: {count} hour{count, plural, =1{} other{s}} ago
ar: منذ {count} ساعة

# videosScreenDaysAgo
source: {count} day{count, plural, =1{} other{s}} ago
ar: منذ {count} يوم

# videosScreenRefreshTooltip
source: Refresh Playlists
ar: تحديث قوائم التشغيل

# videosScreenScrollToTopTooltip
source: Scroll to top
ar: التمرير إلى الأعلى

# videosScreenLoadingPlaylists
source: Loading playlists...
ar: جاري تحميل قوائم التشغيل...

# videosScreenErrorTitle
source: Oops! Something Went Wrong
ar: عذراً! حدث خطأ ما

# videosScreenErrorMessage
source: We couldn't load the playlists. Please check your connection and try again.
ar: لم نتمكن من تحميل قوائم التشغيل. يرجى التحقق من اتصالك والمحاولة مرة أخرى.

# videosScreenRetryButton
source: Try Again
ar: إعادة المحاولة

# videosScreenGoHomeButton
source: Go Home
ar: الذهاب للرئيسية

# videosScreenNoPlaylistsTitle
source: No Playlists Found
ar: لم يتم العثور على قوائم تشغيل

# videosScreenNoPlaylistsMessage
source: We couldn't find any video playlists at the moment.
ar: لم نتمكن من العثور على أي قوائم تشغيل فيديو في الوقت الحالي.

# videosScreenOutdatedDataWarning
source: Some data might be outdated. {error}
ar: بعض البيانات قد تكون قديمة. {error}

# videosScreenNetworkError
source: Network error: Connection lost. Videos may not load properly.
ar: خطأ في الشبكة: انقطع الاتصال. قد لا يتم تحميل مقاطع الفيديو بشكل صحيح.

# videosScreenNoInternetConnection
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# accessibilityVideoPlaylist
source: Video playlist: {title}
ar: قائمة تشغيل الفيديو: {title}

# accessibilityRefreshButton
source: Refresh content
ar: تحديث المحتوى

# accessibilityScrollToTop
source: Scroll to top of page
ar: التمرير إلى أعلى الصفحة

# accessibilityNetworkStatus
source: Network connection status
ar: حالة اتصال الشبكة

# accessibilityErrorState
source: Error occurred while loading content
ar: حدث خطأ أثناء تحميل المحتوى

# accessibilityLoadingState
source: Content is loading
ar: جاري تحميل المحتوى

# accessibilityEmptyState
source: No content available
ar: لا يوجد محتوى متاح
